test/fixtures/quaderno_cassettes/unpay_an_invoice.yml

---
http_interactions:
- request:
    method: get
    uri: http://xiZvifX5hwsxAiymYPk2@localhost:3000/recrea/api/v1/invoices.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      authorization:
      - Basic eGladmlmWDVod3N4QWl5bVlQazI6
  response:
    status:
      code: 200
      message: OK
    headers:
      x-ratelimit-limit:
      - '1000'
      x-ratelimit-remaining:
      - '614'
      content-type:
      - application/json; charset=utf-8
      x-ua-compatible:
      - IE=Edge
      etag:
      - ! '"75bb47308990c924295b7c601cbd2932"'
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - e2947d94d0d71d58da92b2d55b9012b3
      x-runtime:
      - '0.815483'
      content-length:
      - '20926'
      connection:
      - close
      server:
      - thin 1.5.0 codename Knife
    body:
      encoding: US-ASCII
      string: ! '[{"id":"50acb6282f412eda52000059","number":"0000013","issue_date":"2012-11-21","contact":{"id":"50a23cb22f412eae4f000003","full_name":"100-499"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"aaaaaaaaa","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"}],"subtotal":"\u20ac0.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac0.00","payments":[{"id":"50acb6802f412eda5200005e","date":"2012-11-21","method":"credit_card","amount":"\u20ac600.50","url":"http://localhost:3000/recrea/api/v1/invoices/50acb6282f412eda52000059/payments/50acb6802f412eda5200005e.json"}],"tags":[],"payment_details":"","notes":"","state":"partial","url":"http://localhost:3000/recrea/api/v1/invoices/50acb6282f412eda52000059.json"},{"id":"50acd51e2f412eda520000c4","number":"0000015","issue_date":"2012-11-21","contact":{"id":"50a23cb22f412eae4f000003","full_name":"100-499"},"po_number":null,"due_date":null,"currency":"EUR","items":[{"description":"Aircraft","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":null,"tax_1_rate":null,"tax_2_name":null,"tax_2_rate":null,"subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"}],"subtotal":"\u20ac0.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac0.00","payments":[],"tags":[],"payment_details":"","notes":"","state":"draft","url":"http://localhost:3000/recrea/api/v1/invoices/50acd51e2f412eda520000c4.json"},{"id":"50aca8ec2f412eda52000037","number":"0000012","issue_date":"2012-11-21","contact":{"id":"50a23cb22f412eae4f000003","full_name":"100-499"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Teacup
        pig","quantity":"1.0","unit_price":"500.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac500.00","discount":"\u20ac0.00","gross_amount":"\u20ac500.00"}],"subtotal":"\u20ac500.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac500.00","payments":[{"id":"50aca93e2f412eda5200003b","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50aca8ec2f412eda52000037/payments/50aca93e2f412eda5200003b.json"},{"id":"50acdd682f412eda520000d2","date":"2012-11-21","method":"cash","amount":"\u20ac100,000,000.00","url":"http://localhost:3000/recrea/api/v1/invoices/50aca8ec2f412eda52000037/payments/50acdd682f412eda520000d2.json"}],"tags":[],"payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50aca8ec2f412eda52000037.json"},{"id":"50acdd692f412eda520000d4","number":"0000014","issue_date":"2012-11-21","contact":{"id":"50a23cb22f412eae4f000003","full_name":"100-499"},"po_number":null,"due_date":null,"currency":"EUR","items":[{"description":"Aircraft","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":null,"tax_1_rate":null,"tax_2_name":null,"tax_2_rate":null,"subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"}],"subtotal":"\u20ac0.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac0.00","payments":[],"tags":[],"payment_details":"","notes":"","state":"draft","url":"http://localhost:3000/recrea/api/v1/invoices/50acdd692f412eda520000d4.json"},{"id":"50ac9c612f412eda52000001","number":"0000010","issue_date":"2012-11-21","contact":{"id":"50aa3e162f412ec2ab000019","full_name":"Jonz"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Aircraft","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"}],"subtotal":"\u20ac0.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac0.00","payments":[{"id":"50aca3302f412eda5200000f","date":"2012-11-21","method":"credit_card","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca3302f412eda5200000f.json"},{"id":"50aca35d2f412eda52000011","date":"2012-11-21","method":"credit_card","amount":"\u20ac3,000.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca35d2f412eda52000011.json"},{"id":"50aca3dc2f412eda52000013","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca3dc2f412eda52000013.json"},{"id":"50aca4092f412eda52000015","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca4092f412eda52000015.json"},{"id":"50aca47d2f412eda52000017","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca47d2f412eda52000017.json"},{"id":"50aca4a52f412eda52000019","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca4a52f412eda52000019.json"},{"id":"50aca58e2f412eda5200001f","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca58e2f412eda5200001f.json"},{"id":"50aca5e52f412eda52000021","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca5e52f412eda52000021.json"},{"id":"50aca60f2f412eda52000023","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca60f2f412eda52000023.json"},{"id":"50aca6b82f412eda52000025","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca6b82f412eda52000025.json"},{"id":"50aca75d2f412eda52000027","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca75d2f412eda52000027.json"},{"id":"50aca7fa2f412eda5200002e","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca7fa2f412eda5200002e.json"},{"id":"50aca8262f412eda52000030","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca8262f412eda52000030.json"},{"id":"50aca8372f412eda52000032","date":"2012-11-21","method":"credit_card","amount":"\u20ac56,600.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001/payments/50aca8372f412eda52000032.json"}],"tags":[],"payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50ac9c612f412eda52000001.json"},{"id":"50ab7e952f412e672c000002","number":"0000009","issue_date":"2012-11-20","contact":{"id":"50a23cb22f412eae4f000003","full_name":"100-499"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Something","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"},{"description":"Another
        thing","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"},{"description":"And
        finally,another thing","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"}],"subtotal":"\u20ac0.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac0.00","payments":[{"id":"50ab882e2f412e672c000010","date":"2012-11-20","method":"credit_card","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ab7e952f412e672c000002/payments/50ab882e2f412e672c000010.json"},{"id":"50ab88332f412e672c000012","date":"2012-11-20","method":"credit_card","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ab7e952f412e672c000002/payments/50ab88332f412e672c000012.json"},{"id":"50ab88372f412e672c000014","date":"2012-11-20","method":"credit_card","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50ab7e952f412e672c000002/payments/50ab88372f412e672c000014.json"}],"tags":[],"payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50ab7e952f412e672c000002.json"},{"id":"50aa3e262f412ec2ab00001d","number":"0000008","issue_date":"2012-11-19","contact":{"id":"50aa3e162f412ec2ab000019","full_name":"Jonz"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"SOmething","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"}],"subtotal":"\u20ac0.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac0.00","payments":[{"id":"50aa3e2c2f412ec2ab000022","date":"2012-11-19","method":"wire_transfer","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50aa3e262f412ec2ab00001d/payments/50aa3e2c2f412ec2ab000022.json"},{"id":"50aa3fd42f412ec2ab000026","date":"2012-11-19","method":"credit_card","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50aa3e262f412ec2ab00001d/payments/50aa3fd42f412ec2ab000026.json"},{"id":"50aa40592f412ec2ab00002a","date":"2012-11-19","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50aa3e262f412ec2ab00001d/payments/50aa40592f412ec2ab00002a.json"},{"id":"50aa405a2f412ec2ab00002c","date":"2012-11-19","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50aa3e262f412ec2ab00001d/payments/50aa405a2f412ec2ab00002c.json"}],"tags":[],"payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50aa3e262f412ec2ab00001d.json"},{"id":"50a371e42f412e6b93000029","number":"0000007","issue_date":"2012-11-14","contact":{"id":"50a23cb22f412eae4f000003","full_name":"100-499"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Chips","quantity":"1.0","unit_price":"100.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac100.00","discount":"\u20ac0.00","gross_amount":"\u20ac100.00"}],"subtotal":"\u20ac100.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac100.00","payments":[{"id":"50a38a9a2f412e1460000011","date":"2012-11-14","method":"wire_transfer","amount":"\u20ac100.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50a38a9a2f412e1460000011.json"},{"id":"50a39fb02f412e1d39000005","date":"2012-11-14","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50a39fb02f412e1d39000005.json"},{"id":"50a39ff12f412e1d39000007","date":"2012-11-14","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50a39ff12f412e1d39000007.json"},{"id":"50a3a0402f412e1d3900000b","date":"2012-11-14","method":"direct_debit","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50a3a0402f412e1d3900000b.json"},{"id":"50a3a07e2f412e1d3900000f","date":"2012-11-14","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50a3a07e2f412e1d3900000f.json"},{"id":"50a3a0f92f412e1d39000013","date":"2012-11-14","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50a3a0f92f412e1d39000013.json"},{"id":"50a3a1562f412e1d39000017","date":"2012-11-14","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50a3a1562f412e1d39000017.json"},{"id":"50a3a17e2f412e1d3900001b","date":"2012-11-14","method":"credit_card","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50a3a17e2f412e1d3900001b.json"},{"id":"50aa3ad62f412ec2ab000003","date":"2012-11-19","method":"credit_card","amount":"\u20ac20.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50aa3ad62f412ec2ab000003.json"},{"id":"50aa3ba02f412ec2ab000007","date":"2012-11-19","method":"cash","amount":"\u20ac10.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50aa3ba02f412ec2ab000007.json"},{"id":"50aa3bfd2f412ec2ab00000b","date":"2012-11-19","method":"credit_card","amount":"\u20ac-30.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50aa3bfd2f412ec2ab00000b.json"},{"id":"50aa3db42f412ec2ab00000f","date":"2012-11-19","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029/payments/50aa3db42f412ec2ab00000f.json"}],"tags":[],"payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50a371e42f412e6b93000029.json"},{"id":"50a21a3c2f412e1a6800000b","number":"0000003","issue_date":"2012-11-13","contact":{"id":"50a0d1eb2f412e58a700000b","full_name":"ACME"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Pizza","quantity":"1.0","unit_price":"15.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac15.00","discount":"\u20ac0.00","gross_amount":"\u20ac15.00"}],"subtotal":"\u20ac15.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac15.00","payments":[{"id":"50a21a552f412e1a68000010","date":"2012-11-13","method":"iou","amount":"\u20ac15.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a21a3c2f412e1a6800000b/payments/50a21a552f412e1a68000010.json"}],"tags":[],"payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50a21a3c2f412e1a6800000b.json"},{"id":"50a21bf72f412e1a68000018","number":"0000004","issue_date":"2012-11-13","contact":{"id":"50a21bf72f412e1a68000017","full_name":"Matusalen"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Red
        Bull","quantity":"1000.0","unit_price":"0.9","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac900.00","discount":"\u20ac0.00","gross_amount":"\u20ac900.00"}],"subtotal":"\u20ac900.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac900.00","payments":[{"id":"50a21c052f412e1a6800001d","date":"2012-11-13","method":"cash","amount":"\u20ac900.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a21bf72f412e1a68000018/payments/50a21c052f412e1a6800001d.json"},{"id":"50a21c4b2f412e1a68000021","date":"2012-11-13","method":"cash","amount":"\u20ac1.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a21bf72f412e1a68000018/payments/50a21c4b2f412e1a68000021.json"}],"tags":[],"payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50a21bf72f412e1a68000018.json"},{"id":"50a21cb92f412e1a6800002a","number":"0000005","issue_date":"2012-11-13","contact":{"id":"50a21c9e2f412e1a68000026","full_name":"Test_OCP"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Lasagna","quantity":"3.0","unit_price":"15.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac45.00","discount":"\u20ac0.00","gross_amount":"\u20ac45.00"}],"subtotal":"\u20ac45.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac45.00","payments":[{"id":"50a21cc12f412e1a6800002f","date":"2012-11-13","method":"cash","amount":"\u20ac45.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a21cb92f412e1a6800002a/payments/50a21cc12f412e1a6800002f.json"},{"id":"50a21cf72f412e1a68000033","date":"2012-11-13","method":"wire_transfer","amount":"\u20ac15.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a21cb92f412e1a6800002a/payments/50a21cf72f412e1a68000033.json"},{"id":"50a21d1c2f412e1a68000037","date":"2012-11-13","method":"paypal","amount":"\u20ac15.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a21cb92f412e1a6800002a/payments/50a21d1c2f412e1a68000037.json"}],"tags":[],"payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50a21cb92f412e1a6800002a.json"},{"id":"50a23cc32f412eae4f000007","number":"0000006","issue_date":"2012-11-13","contact":{"id":"50a23cb22f412eae4f000003","full_name":"100-499"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"aaaaaaa","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"}],"subtotal":"\u20ac0.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac0.00","payments":[{"id":"50a23ccc2f412eae4f00000c","date":"2012-11-13","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a23ccc2f412eae4f00000c.json"},{"id":"50a24b3a2f412e55af000005","date":"2012-11-13","method":"credit_card","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a24b3a2f412e55af000005.json"},{"id":"50a24b952f412e55af000009","date":"2012-11-13","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a24b952f412e55af000009.json"},{"id":"50a24bbe2f412e55af00000d","date":"2012-11-13","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a24bbe2f412e55af00000d.json"},{"id":"50a24e5c2f412e98a2000001","date":"2012-11-13","method":"paypal","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a24e5c2f412e98a2000001.json"},{"id":"50a2575a2f412e98a2000005","date":"2012-11-13","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a2575a2f412e98a2000005.json"},{"id":"50a259462f412e98a200000b","date":"2012-11-13","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a259462f412e98a200000b.json"},{"id":"50a25a532f412e98a200000f","date":"2012-11-13","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a25a532f412e98a200000f.json"},{"id":"50a35e572f412e6b93000004","date":"2012-11-14","method":"cash","amount":"\u20ac0.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a35e572f412e6b93000004.json"},{"id":"50a35e932f412e6b93000008","date":"2012-11-14","method":"iou","amount":"\u20ac10.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a35e932f412e6b93000008.json"},{"id":"50a3603d2f412e6b9300000e","date":"2012-11-14","method":"check","amount":"\u20ac10.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a3603d2f412e6b9300000e.json"},{"id":"50a364e92f412e6b93000014","date":"2012-11-14","method":"cash","amount":"\u20ac20.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007/payments/50a364e92f412e6b93000014.json"}],"tags":[],"payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50a23cc32f412eae4f000007.json"},{"id":"50a0df0f2f412ee00e000022","number":"0000002","issue_date":"2012-11-12","contact":{"id":"50a0d1eb2f412e58a700000b","full_name":"ACME"},"po_number":"","due_date":null,"currency":"EUR","items":[{"description":"Test
        2","quantity":"1.0","unit_price":"0.0","discount_rate":"0.0","tax_1_name":"","tax_1_rate":"","tax_2_name":"","tax_2_rate":"","subtotal":"\u20ac0.00","discount":"\u20ac0.00","gross_amount":"\u20ac0.00"}],"subtotal":"\u20ac0.00","discount":"\u20ac0.00","taxes":[],"total":"\u20ac0.00","payments":[{"id":"50a0df412f412eca4300002e","date":"2012-11-12","method":"credit_card","amount":"\u20ac1.00","url":"http://localhost:3000/recrea/api/v1/invoices/50a0df0f2f412ee00e000022/payments/50a0df412f412eca4300002e.json"}],"tags":"[]","payment_details":"","notes":"","state":"paid","url":"http://localhost:3000/recrea/api/v1/invoices/50a0df0f2f412ee00e000022.json"}]'
    http_version: '1.1'
  recorded_at: Wed, 21 Nov 2012 13:55:58 GMT
- request:
    method: delete
    uri: http://xiZvifX5hwsxAiymYPk2@localhost:3000/recrea/api/v1/invoices/50acb6282f412eda52000059/payments/50acb6802f412eda5200005e.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      authorization:
      - Basic eGladmlmWDVod3N4QWl5bVlQazI6
  response:
    status:
      code: 204
      message: No Content
    headers:
      x-ratelimit-limit:
      - '1000'
      x-ratelimit-remaining:
      - '613'
      x-ua-compatible:
      - IE=Edge
      cache-control:
      - no-cache
      set-cookie:
      - _quaderno_session=BAh7BkkiD3Nlc3Npb25faWQGOgZFRkkiJTM2Y2RlODkzODAxYWJhNmQ5ODJmNWE0MTRlNTliNDA5BjsAVA%3D%3D--108f08b9dfcf5a9a29f8f67764079a6bfda43254;
        path=/; HttpOnly
      x-request-id:
      - cfb963dc7ad3829fff0c41905527be8d
      x-runtime:
      - '0.120898'
      connection:
      - close
      server:
      - thin 1.5.0 codename Knife
    body:
      encoding: US-ASCII
      string: ''
    http_version: '1.1'
  recorded_at: Wed, 21 Nov 2012 13:55:58 GMT
recorded_with: VCR 2.3.0
